{"meta":{"title":"Jamence's blog","subtitle":"everything is funny when you are exploring","description":"Jamence的个人博客","author":"Jamence","url":"http://yoursite.com"},"pages":[{"title":"","date":"2018-02-24T13:58:39.736Z","updated":"2018-02-24T13:58:39.736Z","comments":true,"path":"about/index.html","permalink":"http://yoursite.com/about/index.html","excerpt":"","text":"I am nobody with curiosity. Three virtue you should pay attention Laziness The quality that makes you go to great effort to reduce overall energy expenditure. It makes you write labor-saving programs that other people will find useful, and document what you wrote so you don’t have to answer so many questions about it. Hence, the first great virtue of a programmer, Also hence, this book. Impatience The anger you feel when the computer is being lazy. This makes you write programs that don’t just react to your needs, but actually anticipate them. Or at least pretend to. Hence, the second great virtue of a programmer. Hubris Excessive pride, the sort of thing Zeus zaps you for. Also the quality that makes you write (and maintain) programs that other people won’t want to say bad things about. Hence, the third great virtue of a programmer. 懒惰：是这样一种品质，它使得你花大力气去避免消耗过多的精力。它敦促你写出节省体力的程序，同时别人也能利用它们。为此你会写出完善的文档，以免别人问你太多问题。急躁：是这样一种愤怒——当你发现计算机懒洋洋地不给出结果。于是你写出更优秀的代码，能尽快真正的解决问题。至少看上去是这样。傲慢：极度的自信，使你有信心写出（或维护）别人挑不出毛病的程序。"}],"posts":[{"title":"Hello World","slug":"hello-world","date":"2018-02-08T08:49:36.568Z","updated":"2018-02-24T14:11:53.466Z","comments":true,"path":"2018/02/08/hello-world/","link":"","permalink":"http://yoursite.com/2018/02/08/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Clean cache1$ hexo clean Generate static files1$ hexo generate More info: Generating Compress code using gulp1$ gulp More info: Gulp Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}